Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УточнениеИсполнителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ПроцентВыполненныхРабот/торо_ПроцентВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПроцентВыполненныхРабот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидДокумента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ОперацииВнешнихОснованийДляРабот/торо_ОперацииВнешнихОснованийДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОперацииВнешнихОснованийДляРабот</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Предписание_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ПлановыеЗатраты/торо_ПлановыеЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПлановыеЗатраты</name>
  <comment>Фиктивный документ для ввода плановых затрат  в цепочке ППР/ГрафикРМ -- Акт/АктРМ</comment>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <attributes>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлана</name>
    <type>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехКарты</name>
    <attributes>
      <name>ТехКарта</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
        <types>CatalogRef.торо_ТехКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехКарта_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеЗаявки</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявокУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявок</registerRecords>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ППРИнициатор</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакрываемыеЗаявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/CommonModules/торо_ПроцентыВыполнения/Module.bsl
/////////////////////////////////////////////////////////////////////////////////////
//
// торо_ПроцентыВыполнения: методы для работы с процентами выполнения ремонтных работ
//
/////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция НайтиОперациюВРегистре(Операция, Родитель_ID, РемонтОборудования, НоваяОперация, Ссылка) Экспорт
	
	МассивВозврата = Новый Массив;
	СтруктураВозврата = Новый Структура("ID, Процент, Новая, Операция");
	
	Если НоваяОперация = Истина Тогда
		СтруктураВозврата.ID = Новый УникальныйИдентификатор;
		СтруктураВозврата.Процент = 0;
		СтруктураВозврата.Операция = Справочники.торо_ТехнологическиеОперации.ПустаяСсылка();
		СтруктураВозврата.Новая = Истина;
		МассивВозврата.Добавить(СтруктураВозврата);
	Иначе
		
		РезультатЗапроса = ПолучитьПроцентВыполненияОперации(Операция, Родитель_ID, РемонтОборудования, Ссылка);
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтруктураВозврата = Новый Структура("ID, Процент, Операция, Документ, НомерСтроки, Новая");
				ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
				СтруктураВозврата.Новая = Ложь;
				МассивВозврата.Добавить(СтруктураВозврата);
			КонецЦикла; 
		Иначе
			СтруктураВозврата.ID = Новый УникальныйИдентификатор;
			СтруктураВозврата.Процент = 0;
			СтруктураВозврата.Новая = Истина;
			МассивВозврата.Добавить(СтруктураВозврата);
		КонецЕсли;
	КонецЕсли;
	Возврат МассивВозврата;
КонецФункции

Процедура СоздатьДокументыПлановыхЗатрат(РемонтыОборудования, РемонтныеРаботы, Регламентное) Экспорт
	Для каждого Строка Из РемонтыОборудования Цикл
		Если (Регламентное ИЛИ ОтсутствиеСметыПоРемонтуИзППР(Строка.ID))
			Тогда
			
			НайденныйДокумент = Документы.торо_ПлановыеЗатраты.НайтиПоРеквизиту("РемонтыОборудования_ID", Строка.ID);
			Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
				
				Док = НайденныйДокумент.ПолучитьОбъект();
				ТКОчищены = Ложь;
				
				Для каждого Работа Из РемонтныеРаботы Цикл
					Если ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") и Работа.РемонтыОборудования_ID = Строка.ID Тогда
						
						ПараметрыОтбора = Новый Структура("ТехКарта", Работа.РемонтнаяРабота); 
						НайденныеСтроки = Док.ТехКарты.НайтиСтроки(ПараметрыОтбора);
						
						Если НайденныеСтроки.Количество() = 0 Тогда
							Док.ТехКарты.Очистить();
							ТКОчищены = Истина;
							Прервать;
						КонецЕсли; 
					КонецЕсли; 
				
				КонецЦикла;
				
				Если ТКОчищены Тогда
					Для каждого Работа Из РемонтныеРаботы Цикл
						Если ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") и Работа.РемонтыОборудования_ID = Строка.ID Тогда
							НоваяСтрока = Док.ТехКарты.Добавить();
							НоваяСтрока.ТехКарта = Работа.РемонтнаяРабота;
							НоваяСтрока.ТехКарта_ID = Работа.ID;
						КонецЕсли;
					КонецЦикла;				
				КонецЕсли; 
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйДокумент = Документы.торо_ПлановыеЗатраты.СоздатьДокумент();
				НовыйДокумент.Дата = Строка.ДатаНачала;
				НовыйДокумент.ДокументПлана = Строка.ДокументИсточник;
				НовыйДокумент.ОбъектРемонта = Строка.ОбъектРемонта;
				НовыйДокумент.РемонтыОборудования_ID = Строка.ID;
				Для каждого Работа Из РемонтныеРаботы Цикл
					Если ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") и Работа.РемонтыОборудования_ID = Строка.ID Тогда
						НоваяСтрока = НовыйДокумент.ТехКарты.Добавить();
						НоваяСтрока.ТехКарта = Работа.РемонтнаяРабота;
						НоваяСтрока.ТехКарта_ID = Работа.ID;
					КонецЕсли; 
				КонецЦикла;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);	
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЦикла; 	
КонецПроцедуры

Функция ОтсутствиеСметыПоРемонтуИзППР(IDРемонта)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_ППР
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ID = &IDРемонта) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_Заявки
	               |ИЗ
	               |	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(, IDРемонта = &IDРемонта) КАК торо_ЗаявкиПоРемонтамСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	IDРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_Отмененные
	               |ИЗ
	               |	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(, ID = &IDРемонта) КАК торо_ОтмененныеРемонтыСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заявки.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_НеОтмененныеЗаявки
	               |ИЗ
	               |	ВТ_Заявки КАК ВТ_Заявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отмененные КАК ВТ_Отмененные
	               |		ПО ВТ_Заявки.IDРемонта = ВТ_Отмененные.ID
	               |ГДЕ
	               |	ВТ_Отмененные.ID ЕСТЬ NULL
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	IDРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ППР.ID КАК ID
	               |ИЗ
	               |	ВТ_ППР КАК ВТ_ППР
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеОтмененныеЗаявки КАК ВТ_НеОтмененныеЗаявки
	               |		ПО (ВТ_НеОтмененныеЗаявки.IDРемонта = ВТ_ППР.ID)
	               |ГДЕ
	               |	ВТ_НеОтмененныеЗаявки.IDРемонта ЕСТЬ NULL";
	Запрос.УстановитьПараметр("IDРемонта", IDРемонта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции 

Процедура ПолучитьНевыполненныеПроценты(ТЧ_РемонтныхРабот, Ссылка, РемонтыОборудования_ID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаРемонтныхРабот.ID КАК ID,
	               |	ТаблицаРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	ТаблицаРемонтныхРабот.Родитель_ID КАК Родитель_ID,
	               |	ТаблицаРемонтныхРабот.Количество КАК Количество,
	               |	ТаблицаРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	               |ПОМЕСТИТЬ ВТ_РемонтыеРаботы
	               |ИЗ
	               |	&ТаблицаРемонтныхРабот КАК ТаблицаРемонтныхРабот
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	РемонтыОборудования_ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ПроцентВыполненныхРабот.IDОперации КАК ID,
	               |	торо_ПроцентВыполненныхРабот.Операция КАК Операция,
	               |	торо_ПроцентВыполненныхРабот.Регистратор КАК Документ,
	               |	торо_ПроцентВыполненныхРабот.Процент КАК Процент,
				   |	торо_ПроцентВыполненныхРабот.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_ПлановыеЗатраты)
	               |			ТОГДА 0
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |			ТОГДА 1
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов)
	               |			ТОГДА 2
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	               |			ТОГДА 3
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие)
	               |			ТОГДА 4
	               |		ИНАЧЕ 5
	               |	КОНЕЦ КАК Приоритет,
	               |	торо_ПроцентВыполненныхРабот.IDРодителя КАК IDРодителя,
	               |	торо_ПроцентВыполненныхРабот.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_Операции
	               |ИЗ
	               |	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
	               |ГДЕ
	               |	торо_ПроцентВыполненныхРабот.IDРемонта В
	               |			(ВЫБРАТЬ
	               |				ВТ_РемонтыеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	               |			ИЗ
	               |				ВТ_РемонтыеРаботы КАК ВТ_РемонтыеРаботы)
	               |	И торо_ПроцентВыполненныхРабот.Регистратор <> &Ссылка
	               |	И торо_ПроцентВыполненныхРабот.IDРемонта = &РемонтыОборудования_ID
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |   ВТ_Операции.ID КАК ID,
				   |   ВТ_Операции.Операция КАК Операция,
				   |   ВТ_Операции.Документ КАК Документ,
				   |   ВТ_Операции.Процент КАК Процент,
				   |   ВТ_Операции.Приоритет КАК Приоритет, 
				   |   ВТ_Операции.IDРодителя КАК IDРодителя,
				   |   ВТ_Операции.IDРемонта КАК IDРемонта
				   |ПОМЕСТИТЬ ВТ_ВсеОперации
				   |ИЗ
				   |  ВТ_Операции КАК ВТ_Операции
				   |
				   |ОБЪЕДИНИТЬ 
				   | 
				   |ВЫБРАТЬ 
				   |  торо_ОперацииВнешнихОснованийДляРабот.ID,
				   |  торо_ОперацииВнешнихОснованийДляРабот.РемонтнаяРабота,
				   |  торо_ОперацииВнешнихОснованийДляРабот.Регистратор, 
				   |  торо_ОперацииВнешнихОснованийДляРабот.Количество*100,
				   |  0, 
				   |  торо_ОперацииВнешнихОснованийДляРабот.Родитель_ID, 
				   |  торо_ОперацииВнешнихОснованийДляРабот.Предписание_ID
				   |ИЗ 
				   |  РегистрСведений.торо_ОперацииВнешнихОснованийДляРабот КАК торо_ОперацииВнешнихОснованийДляРабот
				   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
				   |        ПО торо_ОперацииВнешнихОснованийДляРабот.ID = ВТ_Операции.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	МИНИМУМ(ВТ_ВсеОперации.Приоритет) КАК Приоритет,
	               |	ВТ_ВсеОперации.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_МинимумПриоритетов
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |ГДЕ
	               |	ВТ_ВсеОперации.Приоритет < 5
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеОперации.ID,
	               |	ВТ_ВсеОперации.IDРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	МАКСИМУМ(ВТ_ВсеОперации.Процент) КАК Процент,
	               |	ВТ_ВсеОперации.Приоритет КАК Приоритет,
	               |	ВТ_ВсеОперации.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_План
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимумПриоритетов КАК ВТ_МинимумПриоритетов
	               |		ПО ВТ_ВсеОперации.ID = ВТ_МинимумПриоритетов.ID
	               |			И ВТ_ВсеОперации.Приоритет = ВТ_МинимумПриоритетов.Приоритет
	               |			И ВТ_ВсеОперации.IDРемонта = ВТ_МинимумПриоритетов.IDРемонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеОперации.ID,
	               |	ВТ_ВсеОперации.Приоритет,
	               |	ВТ_ВсеОперации.IDРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	СУММА(ВТ_ВсеОперации.Процент) КАК Процент,
	               |	ВТ_ВсеОперации.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_Факт
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |ГДЕ
	               |	ВТ_ВсеОперации.Приоритет = 5
	               |	И ВТ_ВсеОперации.Процент < 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеОперации.ID,
	               |	ВТ_ВсеОперации.IDРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	ВТ_ВсеОперации.Операция КАК Операция,
	               |	ЕСТЬNULL(ВТ_План.Процент, 0) + ЕСТЬNULL(ВТ_Факт.Процент, 0) КАК Процент,
	               |	ВТ_ВсеОперации.IDРодителя КАК IDРодителя,
	               |	ВТ_ВсеОперации.IDРемонта КАК IDРемонта
	               |ПОМЕСТИТЬ ВТ_ПлановоеОсталось
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_План КАК ВТ_План
	               |		ПО ВТ_ВсеОперации.ID = ВТ_План.ID
	               |			И ВТ_ВсеОперации.Приоритет = ВТ_План.Приоритет
	               |			И ВТ_ВсеОперации.IDРемонта = ВТ_План.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	               |		ПО ВТ_ВсеОперации.ID = ВТ_Факт.ID
	               |			И ВТ_ВсеОперации.IDРемонта = ВТ_Факт.IDРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_РемонтыеРаботы.ID КАК ID,
	               |	ВТ_РемонтыеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	ВТ_РемонтыеРаботы.Родитель_ID КАК Родитель_ID,
	               |	ВТ_РемонтыеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
				  // |    (ВТ_ПлановоеОсталось.Процент ЕСТЬ NULL) КАК НоваяОперация,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПлановоеОсталось.Процент ЕСТЬ NULL
	               |			ТОГДА 100
	               |		КОГДА ВТ_ПлановоеОсталось.Процент < 0
	               |			ТОГДА (100 + ВТ_ПлановоеОсталось.Процент) / ВТ_РемонтыеРаботы.Количество
	               |		ИНАЧЕ ВТ_ПлановоеОсталось.Процент / ВТ_РемонтыеРаботы.Количество
	               |	КОНЕЦ КАК Процент
	               |ИЗ
	               |	ВТ_РемонтыеРаботы КАК ВТ_РемонтыеРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановоеОсталось КАК ВТ_ПлановоеОсталось
	               |		ПО ВТ_РемонтыеРаботы.ID = ВТ_ПлановоеОсталось.ID
	               |			И ВТ_РемонтыеРаботы.РемонтыОборудования_ID = ВТ_ПлановоеОсталось.IDРемонта
	               |			И ВТ_РемонтыеРаботы.Родитель_ID = ВТ_ПлановоеОсталось.IDРодителя
				   | ГДЕ ВТ_РемонтыеРаботы.РемонтыОборудования_ID = &РемонтыОборудования_ID";
	Если ТипЗнч(ТЧ_РемонтныхРабот) = Тип("ТаблицаЗначений") Тогда
	    Запрос.УстановитьПараметр("ТаблицаРемонтныхРабот", ТЧ_РемонтныхРабот);
	Иначе
		Запрос.УстановитьПараметр("ТаблицаРемонтныхРабот", ТЧ_РемонтныхРабот.Выгрузить());
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если НЕ ЗначениеЗаполнено(РемонтыОборудования_ID) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_ПроцентВыполненныхРабот.IDРемонта = &РемонтыОборудования_ID", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_РемонтыеРаботы.РемонтыОборудования_ID = &РемонтыОборудования_ID", "Истина");
	Иначе
		Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтыОборудования_ID);
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		СтруктураПоиска = Новый Структура("ID, РемонтнаяРабота, Родитель_ID, РемонтыОборудования_ID");
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			Найденное = ТЧ_РемонтныхРабот.НайтиСтроки(СтруктураПоиска);
			Если Найденное.Количество() = 1 Тогда
				Найденное[0].ПроцентВыполненияРабот = Выборка.Процент;
				//Найденное[0].НоваяОперация = Выборка.НоваяОперация;								
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьПроцентыВыполненияВДереве(ДеревоРемонтов) Экспорт
	Для каждого Строка Из ДеревоРемонтов.Строки Цикл
		СтруктураПолученная = ПроцентВыполненияПодчиненных(Строка);
		Строка.ПроцентВыполненияРабот = ?(СтруктураПолученная.Количество = 0, СтруктураПолученная.Процент, СтруктураПолученная.Процент/СтруктураПолученная.Количество);
	КонецЦикла;
КонецПроцедуры

Функция ПроцентВыполненияПодчиненных(СтрокаДереваРемонтов)

	КоличествоПодчиненных = 0;
	ПроцентПодчиненных = 0;
	
	Для каждого СтрокаПодчиненная Из СтрокаДереваРемонтов.Строки Цикл
		Если ТипЗнч(СтрокаПодчиненная.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			СтруктураПолученная = Новый Структура("Количество, Процент", СтрокаПодчиненная.Количество, СтрокаПодчиненная.ПроцентВыполненияРабот);	
		Иначе
			СтруктураПолученная = ПроцентВыполненияПодчиненных(СтрокаПодчиненная);
		КонецЕсли; 
		КоличествоПодчиненных = КоличествоПодчиненных + СтруктураПолученная.Количество; 
		ПроцентПодчиненных = ПроцентПодчиненных + СтруктураПолученная.Процент * СтруктураПолученная.Количество;
	КонецЦикла;
	
	СтрокаДереваРемонтов.ПроцентВыполненияРабот = ?(КоличествоПодчиненных = 0, 100, ПроцентПодчиненных / КоличествоПодчиненных);
	СтруктураВозврата = Новый Структура("Количество, Процент", СтрокаДереваРемонтов.Количество, СтрокаДереваРемонтов.ПроцентВыполненияРабот);
	
	Возврат СтруктураВозврата;	

КонецФункции

Функция ПодобратьIDТКИзПлановыхЗатрат(РемонтыОборудования_ID, ТехКарта) Экспорт
	
	ТехКарта_ID = Новый УникальныйИдентификатор;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПлановыеЗатратыТехКарты.ТехКарта_ID КАК ТехКарта_ID
	|ИЗ
	|	Документ.торо_ПлановыеЗатраты.ТехКарты КАК торо_ПлановыеЗатратыТехКарты
	|ГДЕ
	|	торо_ПлановыеЗатратыТехКарты.ТехКарта = &ТехКарта
	|	И торо_ПлановыеЗатратыТехКарты.Ссылка.РемонтыОборудования_ID = &РемонтыОборудования_ID";
	
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтыОборудования_ID);
	Запрос.УстановитьПараметр("ТехКарта", ТехКарта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТехКарта_ID = Выборка.ТехКарта_ID;	
	КонецЕсли;
	
	Возврат ТехКарта_ID;
	
КонецФункции

Функция ОставшийсяПроцентВыполнения(Операция, РемонтыОборудования_ID, Родитель_ID, IDРемонта) Экспорт	
	РезультатЗапроса = ПолучитьПроцентВыполненияОперации(Операция, Родитель_ID, РемонтыОборудования_ID, Документы.торо_АктОВыполненииРегламентногоМероприятия.ПустаяСсылка(), IDРемонта);
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Процент;
		КонецЦикла;
	Иначе	
		Возврат 100;	
	КонецЕсли;
КонецФункции

Функция ПолучитьПроцентВыполненияОперации(Операция, Родитель_ID, РемонтОборудования, Ссылка, IDРемонта = Неопределено) Экспорт 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ПроцентВыполненныхРабот.IDОперации КАК ID,
	               |	торо_ПроцентВыполненныхРабот.Операция КАК Операция,
	               |	торо_ПроцентВыполненныхРабот.Регистратор КАК Документ,
	               |	торо_ПроцентВыполненныхРабот.Процент КАК Процент,
	               |	торо_ПроцентВыполненныхРабот.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_ПлановыеЗатраты)
	               |			ТОГДА 0
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |			ТОГДА 1
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов)
	               |			ТОГДА 2
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	               |			ТОГДА 3
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ПроцентВыполненныхРабот.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие)
	               |			ТОГДА 4
	               |		ИНАЧЕ 5
	               |	КОНЕЦ КАК Приоритет,
	               |	торо_ПроцентВыполненныхРабот.IDРодителя КАК IDРодителя,
	               |	торо_ПроцентВыполненныхРабот.Регистратор.Дата КАК РегистраторДата
				   |ПОМЕСТИТЬ ВТ_Операции
	               |ИЗ
	               |	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
	               |ГДЕ
	               |	торо_ПроцентВыполненныхРабот.IDРемонта = &РемонтыОборудования_ID
	               |	И торо_ПроцентВыполненныхРабот.IDРодителя = &Родитель_ID
	               |	И торо_ПроцентВыполненныхРабот.Операция = &РемонтнаяРабота
	               |	И торо_ПроцентВыполненныхРабот.Регистратор <> &Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |   ВТ_Операции.ID КАК ID,
				   |   ВТ_Операции.Операция КАК Операция,
				   |   ВТ_Операции.Документ КАК Документ,
				   |   ВТ_Операции.Процент КАК Процент,
				   |   ВТ_Операции.Приоритет КАК Приоритет, 
				   |   ВТ_Операции.НомерСтроки КАК НомерСтроки,
				   |   ВТ_Операции.IDРодителя КАК IDРодителя,
				   |   ВТ_Операции.РегистраторДата КАК РегистраторДата
				   |ПОМЕСТИТЬ ВТ_ВсеОперации
				   |ИЗ
				   |  ВТ_Операции КАК ВТ_Операции
				   |
				   |ОБЪЕДИНИТЬ 
				   | 
				   |ВЫБРАТЬ 
				   |  торо_ОперацииВнешнихОснованийДляРабот.ID,
				   |  торо_ОперацииВнешнихОснованийДляРабот.РемонтнаяРабота,
				   |  торо_ОперацииВнешнихОснованийДляРабот.Регистратор, 
				   |  торо_ОперацииВнешнихОснованийДляРабот.Количество*100,
				   |  0, 
				   |  торо_ОперацииВнешнихОснованийДляРабот.НомерСтроки,
				   |  торо_ОперацииВнешнихОснованийДляРабот.Родитель_ID, 
				   |  торо_ОперацииВнешнихОснованийДляРабот.Регистратор.Дата
				   |ИЗ 
				   |  РегистрСведений.торо_ОперацииВнешнихОснованийДляРабот КАК торо_ОперацииВнешнихОснованийДляРабот
				   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
				   |        ПО торо_ОперацииВнешнихОснованийДляРабот.ID = ВТ_Операции.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	МИНИМУМ(ВТ_ВсеОперации.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ ВТ_МинимумПриоритетов
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеОперации.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	ВТ_ВсеОперации.Операция КАК Операция,
	               |	ВТ_ВсеОперации.Документ КАК Документ,
	               |	ВТ_ВсеОперации.Процент КАК Процент,
				   |	ВТ_ВсеОперации.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ВсеОперации.Приоритет КАК Приоритет,
	               |	ВТ_ВсеОперации.IDРодителя КАК IDРодителя,
	               |	ВТ_ВсеОперации.РегистраторДата КАК РегистраторДата
	               |ПОМЕСТИТЬ ВТ_ПервоеПоявлениеОперации
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимумПриоритетов КАК ВТ_МинимумПриоритетов
	               |		ПО (ВТ_МинимумПриоритетов.ID = ВТ_ВсеОперации.ID)
	               |			И (ВТ_МинимумПриоритетов.Приоритет = ВТ_ВсеОперации.Приоритет)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	СУММА(ВТ_ВсеОперации.Процент) КАК Процент,
	               |	ВТ_ВсеОперации.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТ_План
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимумПриоритетов КАК ВТ_МинимумПриоритетов
	               |		ПО ВТ_ВсеОперации.ID = ВТ_МинимумПриоритетов.ID
	               |			И ВТ_ВсеОперации.Приоритет = ВТ_МинимумПриоритетов.Приоритет
	               |ГДЕ
	               |	ВТ_ВсеОперации.Приоритет <> 5
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеОперации.ID,
	               |	ВТ_ВсеОперации.Приоритет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОперации.ID КАК ID,
	               |	СУММА(ВТ_ВсеОперации.Процент) КАК Процент
	               |ПОМЕСТИТЬ ВТ_Факт
	               |ИЗ
	               |	ВТ_ВсеОперации КАК ВТ_ВсеОперации
	               |ГДЕ
	               |	ВТ_ВсеОперации.Приоритет = 5
	               |	И ВТ_ВсеОперации.Процент < 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеОперации.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПервоеПоявлениеОперации.ID КАК ID,
	               |	ВТ_ПервоеПоявлениеОперации.Операция КАК Операция,
	               |	ВТ_ПервоеПоявлениеОперации.Документ КАК Документ,
				   |	ВТ_ПервоеПоявлениеОперации.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ПервоеПоявлениеОперации.Приоритет КАК Приоритет,
	               |	ЕСТЬNULL(ВТ_План.Процент, 0) + ЕСТЬNULL(ВТ_Факт.Процент, 0) КАК Процент,
	               |	ВТ_ПервоеПоявлениеОперации.IDРодителя КАК IDРодителя,
	               |	ВТ_ПервоеПоявлениеОперации.РегистраторДата КАК РегистраторДата
	               |ПОМЕСТИТЬ ВТ_ВсеДокументы
	               |ИЗ
	               |	ВТ_ПервоеПоявлениеОперации КАК ВТ_ПервоеПоявлениеОперации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_План КАК ВТ_План
	               |		ПО ВТ_ПервоеПоявлениеОперации.ID = ВТ_План.ID
	               |			И ВТ_ПервоеПоявлениеОперации.Приоритет = ВТ_План.Приоритет
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	               |		ПО ВТ_ПервоеПоявлениеОперации.ID = ВТ_Факт.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(ВТ_ВсеДокументы.РегистраторДата) КАК РегистраторДата,
	               |	ВТ_ВсеДокументы.ID КАК ID,
	               |	ВТ_ВсеДокументы.Операция КАК Операция,
	               |	ВТ_ВсеДокументы.IDРодителя КАК IDРодителя
	               |ПОМЕСТИТЬ ВТ_МинимумПоДате
	               |ИЗ
	               |	ВТ_ВсеДокументы КАК ВТ_ВсеДокументы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеДокументы.ID,
	               |	ВТ_ВсеДокументы.Операция,
	               |	ВТ_ВсеДокументы.IDРодителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеДокументы.ID КАК ID,
	               |	ВТ_ВсеДокументы.Операция КАК Операция,
	               |	ВТ_ВсеДокументы.Документ КАК Документ,
				   |	ВТ_ВсеДокументы.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ВсеДокументы.Приоритет КАК Приоритет,
	               |	ВТ_ВсеДокументы.Процент КАК Процент,
	               |	ВТ_ВсеДокументы.IDРодителя КАК IDРодителя,
	               |	ВТ_ВсеДокументы.РегистраторДата КАК РегистраторДата
	               |ИЗ
	               |	ВТ_ВсеДокументы КАК ВТ_ВсеДокументы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимумПоДате КАК ВТ_МинимумПоДате
	               |		ПО (ВТ_МинимумПоДате.РегистраторДата = ВТ_ВсеДокументы.РегистраторДата)
	               |			И (ВТ_МинимумПоДате.ID = ВТ_ВсеДокументы.ID)
	               |			И (ВТ_МинимумПоДате.IDРодителя = ВТ_ВсеДокументы.IDРодителя)";
	
	Запрос.УстановитьПараметр("РемонтнаяРабота", Операция);
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтОборудования);
	Запрос.УстановитьПараметр("Родитель_ID", Родитель_ID);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	Если IDРемонта <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ ВТ_ВсеДокументы.ID = &IDРемонта";
		Запрос.УстановитьПараметр("IDРемонта", Строка(IDРемонта));
	КонецЕсли;
	
	Возврат Запрос.Выполнить();

КонецФункции 
  
#КонецОбласти
